package ru.voskresenskaya.interview;

public class Constants {
    public static final String ENCODING = "UTF-8";

    public static final int MAX_TRY_COUNT = 3;

    public static final String TITLE =
            "=================================================================================================" +
            "\nОпределить свой психологический возраст поможет онлайн тест. " +
            "\nКто у Вас внутри? Подросток, жаждущий всего нового? Зрелый самодостаточный семьянин? " +
            "\nПовидавший многое пенсионер или кто‐то другой? Профессиональный тест на возраст покажет истину!";

    public static final String ANSWER_1 =
            "==============================================================================" +
            "\nНезависимо от вашего биологического возраста энергия вас переполняет," +
            "\nа вера в себя на высоком уровне. Психологически Вы моложе 25 лет." +
            "\nВы позитивный человек, с уверенностью смотрите в будущее, цените настоящее," +
            "\nоткрыты новым встречам и опыту. С таким настроем постареете вы точно не скоро" +
            "\n==============================================================================";

    public static final String ANSWER_2 =
            "====================================================================================================" +
            "\nВаш психологический возраст от 30 до 45 лет. На мир вы смотрите со стороны реалиста, не испытывая " +
            "\nложных иллюзий. На своем жизненном пути вам приходилось чем-либо жертвовать ради поставленных целей." +
            "\nСерьезность и ответственность для вас не пустой звук." +
            "\nВот только все эти лишения и испытания несколько уменьшили у вас способность радоваться настоящему." +
            "\n====================================================================================================";

    public static final String ANSWER_3 =
            "=================================================================================================" +
            "\nПсихологически Вы старше 50 лет.Такие люди как вы, независимо от биологического возраста испытали " +
            "\nочень многое, вашему жизненному опыту могут позавидовать. " +
            "\nВы всему знаете цену. Но стоит ли так спешить, когда в мире столько интересных вещей?" +
            "\n=================================================================================================";

    public static final String GOODBYE_MSG = "¯\\_(ツ)_/¯";
}
